<?php
use yii\helpers\Url;
?>
<h3 class="text-center">云豆讲堂服务协议</h3>
<pre>
    本协议系由南京云宝网络有限公司（以下简称“云宝”）与所有使用云豆讲堂服务的主体（包括但不限于个人、团队等）（以下简称“用户”）对云豆讲堂服务的使用及相关服务所订立的有效合约。使用云豆讲堂服务的任何服务即表示接受本协议的全部条款。本协议适用于任何云豆讲堂服务，包括本协议期限内的用户所使用的各项服务和软件的升级和更新。
    一、服务内容及使用须知
    1.云豆讲堂服务是一个向广大用户提供在线模拟考试、在线试题练习、在线信息咨询、在线代办报名等服务平台。云豆讲堂服务本身内置了大量相关考试的题库，提供给用户可以进行在线学习。
    2.云豆讲堂服务仅提供相关的在线学习服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。
    3.用户不得滥用云豆讲堂的服务，云宝在此郑重提请您注意，任何经由非云宝官方以外上传、张贴、发送即时信息、电子邮件或任何其他方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息、用户的登记资料或其他资料（以下简称“内容”），无论系公开还是私下传送，均由内容提供者、使用者对其上传、使用行为自行承担责任。云豆讲堂服务作为信息存储空间服务平台，无法控制经由本服务传送之内容，也无法对用户的使用行为进行全面控制，因此不能保证内容的合法性、正确性、完整性、真实性或品质；您已预知使用本服务时，可能会接触到令人不快、不适当等内容，并同意将自行加以判断并承担所有风险，而不依赖于云豆讲堂服务。
    4.若用户使用云豆讲堂服务的行为不符合本协议，云宝在经由通知、举报等途径发现时有权做出独立判断，且有权在无需事先通知用户的情况下立即终止向用户提供部分或全部服务。用户若通过云豆讲堂服务散布和传播反动、色情或其他违反国家法律、法规的信息，云豆讲堂服务的系统记录有可能作为用户违反法律法规的证据；因用户进行上述内容在云豆讲堂服务的上载、传播而导致任何第三方提出索赔要求或衍生的任何损害或损失，由用户自行承担全部责任。
    5.云宝有权对用户使用云豆讲堂服务网络服务的情况进行监督，如经由通知、举报等 途径发现用户在使用云豆讲堂服务所提供的网络服务时违反任何本协议的规定，云宝有权要求用户改正或直接采取一切云宝认为必要的措施（包括但不限于更改或删除用户上载的内容、暂停或终止用户使用网络服务，和/或公示违法或违反本协议约定使用云豆讲堂服务用户账户的权利）以减轻用户不当行为造成的影响。
    二、所有权
    云宝保留对以下各项内容、信息完全的、不可分割的所有权及知识产权：
    6.未经云宝同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。上述资料或其任何部分仅可作为私人用途而保存在某台计算机内。云豆讲堂服务不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式向用户或任何第三方负法律、经济责任；
    7.云豆讲堂服务为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble），或以其他方式发现其原始编码，以及实施任何涉嫌侵害著作权的行为。
    三、承诺与保证
    8.用户保证，其向云豆讲堂服务上传的内容不得并禁止直接或间接的：
    a)删除、隐匿、改变云豆讲堂服务上显示或其中包含的任何专利、版权、商标或其他所有权声明；
    b)以任何方式干扰或企图干扰云豆讲堂服务或网站任何部分或功能的正常运行；
    c)避开、尝试避开或声称能够避开任何内容保护机制或者云豆讲堂服务数据度量工具；
    d)请求、收集、索取或以其他方式从任何用户那里获取对帐号、密码或其他身份验证凭据的访问权；
    e)为任何用户自动登录到帐号代理身份验证凭据；
    f)提供跟踪功能，包括但不限于识别其他用户在个人主页上查看或操作；
    g)自动将浏览器窗口定向到其他网页；
    h)未经授权冒充他人或获取对云豆讲堂服务的访问权；或者未经用户明确同意，让任何其他人亲自识别该用户。
    i)用户违反上述任何一款的保证，云宝均有权就其情节，对其做出警告、屏蔽、直至取消资格的处罚；如因用户违反上述保证而给云豆讲堂服务、云豆讲堂服务用户或云宝的任何合作伙伴造成损失，用户自行负责承担一切法律责任并赔偿损失。
    9.用户的承诺：
    j)用户利用云豆讲堂服务提供的网络服务上传、发布、传送或通过其他方式传播的内容，不得含有任何违反国家法律法规政策的信息，包括但不限于下列信息：
    i.反对宪法所确定的基本原则的；
    ii.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
    iii.损害国家荣誉和利益的；
    iv.煽动民族仇恨、民族歧视，破坏民族团结的；
    v.破坏国家宗教政策，宣扬邪教和封建迷信的；
    vi.散布谣言，扰乱社会秩序，破坏社会稳定的；
    vii.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
    viii.侮辱或者诽谤他人，侵害他人合法权益的；
    ix.含有法律、行政法规禁止的其他内容的。
    k)用户不得为任何非法目的而使用本网络服务系统；不得利用云豆讲堂服务网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；
    l)用户不得利用云豆讲堂服务的服务从事以下活动：
    x.未经允许，进入计算机信息网络或者使用计算机信息网络资源的；
    xi.未经允许，对计算机信息网络功能进行删除、修改或者增加的；
    xii.未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；
    xiii.故意制作、传播计算机病毒等破坏性程序的；
    xiv.其他危害计算机信息网络安全的行为。
    m)如因用户利用云豆讲堂服务提供的网络服务上传、发布、传送或通过其他方式传播的内容存在权利瑕疵或侵犯了第三方的合法权益（包括但不限于专利权、商标权、著作权及著作权邻接权、肖像权、隐私权、名誉权等）而导致云宝或与云宝合作的其他单位面临任何投诉、举报、质询、索赔、诉讼；或者使云宝或者与云宝合作的其他单位因此遭受任何名誉、声誉或者财产上的损失，用户应积极地采取一切 可能采取的措施，以保证云宝及与云宝合作的其他单位免受上述索赔、诉讼的影响。同时用户对云宝及与云宝合作的其他单位因此遭受的直接及间接经济损失负有全部的损害赔偿责任。
    四、知识产权保护
    如果用户上传的内容允许其他用户下载、查看、收听或以其他方式访问或分发，其必须保证该内容的发布和相关行为实施符合相关知识产权法律法规中相关的版权政策，包括但不限于：
    10.用户在收到侵权通知之时，应立即删除或禁止访问声明的侵权内容，并同时联系递送通知的人员以了解详细信息。
    11.用户知悉并同意云宝将根据相关法律法规对第三方发出的合格的侵权通知进行处理，并按照要求删除或禁止访问声明的侵权内容，采用并实施适当的政策，以期杜绝在相应条件下重复侵权。
    五、隐私保护
    12.云宝充分尊重用户个人信息的保护，云宝的隐私保护声明列出了云豆讲堂服务收集和使用您的个人信息应遵循的相关政策和程序。
    13.云宝不会公开或向第三方提供用户存储在云豆讲堂服务上的非公开内容，除非有下列情况：
    n)有关法律、法规规定或云豆讲堂服务合法服务程序规定；
    o)在紧急情况下，为维护用户及公众的权益；
    p)为维护云宝的商标权、专利权及其他任何合法权益；
    q)其他依法需要公开、编辑或透露个人信息的情况。
    六、免责声明
    14.鉴于网络服务的特殊性，用户同意云豆讲堂服务有权随时变更、中断或终止部分或全部的网络服务。如变更、中断或终止的网络服务属于免费网络服务，云豆讲堂服务无需通知用户，也无需对任何用户或任何第三方承担任何责任。
    15.用户理解，云豆讲堂服务需要定期或不定期地对提供网络服务的平台或相关的设备进行 检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，云豆讲堂服务无需为此承担任何责任，但云豆讲堂服务应尽可能事先进行通告。
    16.云豆讲堂服务可在任何时候为任何原因变更本服务或删除其部分功能。云豆讲堂服务可在任何时候取消或终止对用户的服务。云豆讲堂服务取消或终止服务的决定不需要理由或通知用户。一旦服务取消，用户使用本服务的权利立即终止。 一旦本服务取消或终止，用户在本服务中储存的任何信息可能无法恢复。
    17.云豆讲堂服务不保证（包括但不限于）：
    r)云豆讲堂服务适合用户的使用要求；
    s)云豆讲堂服务不受干扰，及时、安全、可靠或不出现错误；及用户经由云豆讲堂服务取得的任何产品、服务或其他材料符合用户的期望。
    t)用户使用经由云豆讲堂服务下载或取得的任何资料，其风险由用户自行承担；因该等使用导致用户电脑系统损坏或资料流失，用户应自己负完全责任；
    18.基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失， 云豆讲堂服务不承担任何直接、间接的赔偿：
    u)对云豆讲堂服务的使用或无法使用；
    v)经由云豆讲堂服务购买或取得的任何产品、资料或服务；
    w)用户资料遭到未授权的使用或修改；及其他与云豆讲堂服务相关的事宜。
    19.由于用户授权第三方（包括第三方应用）访问/使用云豆讲堂服务的内容所导致的纠纷或损失，应由用户自行负责，与云宝无关。
    七、其他
    20.本协议最终解释权归云宝所有。
    21.本协议一经公布即生效，云宝有权随时对协议内容进行修改，修改后的结果公布于云豆讲堂服务网站上。如果不同意云豆讲堂服务对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受云宝对本协议相关条款所做的修改。
    22.本协议项下云豆讲堂服务对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
    23.本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向云宝所在地的人民法院提起诉讼。
    24.本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
    25.如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
    八、网络空间的“七条底线”
    根据我国网络发展的现状，国信办鲁炜主任提出了网络空间的“七条底线”，我们每位网民在自由表达自己意见和诉求的同时，也要遵守“七条底线”，文明上网，争做文明网民。
    26.法律法规底线：有法可依、有法必依、执法必严、违法必究，任何时候，无论是网上网下，都将始终做到违法必究；
    27.社会主义制度底线，为我们全面建成小康社会提供了有力地制度保障，我们要积极拥护社会主义及社会主义制度；
    28.国家利益底线，作为国家公民，时刻维护我们伟大祖国的利益，这也是宪法赋予我们每位公民的光荣义务；
    29.公民合法权益底线，我们在网络反腐的同时，切记不能以“艳照”等不健康、不正当甚至违法手段对别人进行人身攻击，否则不仅触犯法律，也侵犯了无辜者的合法权益；
    30.社会公共秩序底线，网络世界必须也要遵循一定的秩序规则，唯有如此大家才能营造一个良好健康的网络环境；
    31.道德风尚底线，崇尚美德在我国延续几千年的优秀传统，网络空间里也要讲道德，不做有违道德之事；
    32.信息真实性底线，要求我们在上网时一定要实事求是，而不能以讹传讹、散发谣传，积极宣传政府部门发布的真实信息。
    七条底线是根本，不能突破；是方圆，不能逾越。我们广大网民积极宣传落实“七条底线”，争做文明网民，净化网络空间，还网络一片“蓝天”。
</pre>
<div class="margin-bottom-20 margin-left-10 margin-right-10">
    <a class="btn btn-warning" href="javascript:history.go(-1)">返回</a>
    <a class="btn btn-primary pull-right" href="<?=Url::to(['account/agreement','type'=>'download'])?>">点击下载此协议</a>
</div>
